#include <iostream>   // бібліотека для введення/виведення
using namespace std;

int main()
{
    // ЗАДАЧА Begin1
    //декларація змінних
    double a, P; // a – сторона квадрата, P – периметр
    cout << "Введiть сторону квадрата a: ";
    // введення змінної
    cin >> a; 
    // обчислення
    P = 4 * a;  
    // вивід результату
    cout << "Периметр квадрата дорiвнює: " << P << endl << endl;

    // ЗАДАЧА Begin2
    //декларація змінних
    double S; // S – площа квадрата
    cout << "Введiть сторону квадрата a: ";
    // введення змінної
    cin >> a;
    // обчислення площі
    S = a * a; 
    // вивід результату
    cout << "Площа квадрата дорiвнює: " << S << endl << endl;

    // ЗАДАЧА Begin3
    //декларація змінних
    double b; // перша сторона прямокутника
    cout << "Введiть сторону a: ";
    // введення змінної а
    cin >> a;
    cout << "Введiть сторону b: ";
    // введення змінної b
    cin >> b;
    // обчислення площі
    S = a * b; 
    // обчислення периметру
    P = 2 * (a + b); 
    // вивід результатів
    cout << "Площа прямокутника: " << S << endl;
    cout << "Периметр прямокутника: " << P << endl;

    return 0; // завершення програми
}
