#include <iostream>
using namespace std;

int main()
{
    // задача Begin36
    // декларація змінних
    double L, D;
    const double pi = 3.14;
    // введення змінної
    cout << "Введіть довжину кола L: ";
    cin >> L;
    // розрахунок результату
    D = L / pi;
    // вивід результату
    cout << "Діаметр: " << D << endl;

    // задача Begin15
    // декларація змінних
    double A, B, C, temp;
    // введення змінних
    cout << "Введіть A: ";
    cin >> A;
    cout << "Введіть B: ";
    cin >> B;
    cout << "Введіть C: ";
    cin >> C;
    // перестановка значень
    temp = A;
    A = B;
    B = C;
    C = temp;
    // вивід результату
    cout << "Нове A: " << A << endl;
    cout << "Нове B: " << B << endl;
    cout << "Нове C: " << C << endl;

    // задача Begin26
    // декларація змінних
    double V, U, T1, T2, S;
    // введення змінних
    cout << "Введіть V (швидкість човна у стоячій воді): ";
    cin >> V;
    cout << "Введіть U (швидкість течії): ";
    cin >> U;
    cout << "Введіть T1 (час у озері): ";
    cin >> T1;
    cout << "Введіть T2 (час проти течії): ";
    cin >> T2;
    // розрахунок результату
    S = T1 * V + T2 * (V - U);
    // вивід результату
    cout << "Пройдений шлях: " << S << endl;

    return 0;
}
